# GetAnalyticalShadingSurfaces Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisDetailModel..::..GetAnalyticalShadingSurfaces Method
EnergyAnalysisDetailModel Class See Also
---
The collection of analytical shading surfaces.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IList<EnergyAnalysisSurface> GetAnalyticalShadingSurfaces()
```

Visual Basic
---
```text
Public Function GetAnalyticalShadingSurfaces As IList(Of EnergyAnalysisSurface)
```

Visual C++
---
```text
public:
IList<EnergyAnalysisSurface^>^ GetAnalyticalShadingSurfaces()
```

# ### Return Value
Returns the analytical shading surfaces after model calculation.
# See Also
EnergyAnalysisDetailModel Class
Autodesk.Revit.DB.Analysis Namespace